# Задание 2
#
# Напишите программу, которая запрашивала бы у пользователя два числа и выводила бы True или False в зависимости от того, больше первое число второго или нет.



number1 = int(input("Введите первое число "))
number2 = int(input("Введите второе число "))

if number1 > number2:
    print("True")
else:
    print("False")
